电脑/python/flask/精通flask.org
#+LATEX_CLASS: book
#+LATEX_CLASS_OPTIONS:[11pt,oneside]
#+LATEX_HEADER: \usepackage{book}


#+TITLE: 精通flask框架
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@163.com">a358003542@163.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com


* 前言
flask框架底层基于Werkzeug模块和jinja2模块，关于这两个模块的知识将另行讨论。当然本文一开始就假设读者至少已经算得上精通python语言了，然后对网络编程的一些基础知识已有所了解，那么我们继续吧。


** 第一个例子
安装推荐就简单用pip2或pip3安装之，然后一个简单的helloworld例子如下所示，读者可以先运行一下看看flask框架安装上去了没有。

#+BEGIN_SRC python
from flask import Flask
app = Flask(__name__)

@app.route('/')
def hello_world():
    return 'Hello World!'

if __name__ == '__main__':
    app.run()
#+END_SRC

Flask类提供了所谓的Web Server Gateway Interface，也就是WSGI application。上面代码第一第二行基本上都是这样写的，其中Flask接受的 ~__name__~ 也就是本py文件作为模块被引入时的名字或者是当前执行py文件 ~__main__~ ，这样设置是方便flask找到静态文件（比如通过 ~rend_template~ 函数加载的模板文件，名字是index.html的，flask会在这个app所在的目录下的templates文件夹下面查找这个index.html文件。）等。

然后下面hello_world函数加上了装饰器 ~@app.route('/')~ ，意义是明显是在分发url路径。那么这个函数的返回将作为这个url路径的返回值。



* flask基础
** 路径分发和对应的视图函数
在上面最简单的那个例子中，就已经包含了flask web框架的最核心部分。其包括如下任务: 第一，我们定义该网站的子路径（具体就是对应HTTP协议的GET方法）；第二，如果用户浏览器请求到该路径，那么我们应该给用户浏览器传回去点什么东西。

一般路径分发就是直接把子路径写上去即可，这自不用多说。下面演示分发路径带变量的情况: 

*** 路径分发带变量
#+BEGIN_EXAMPLE
@app.route('/user/<user>')
def get_user(user):
    return "user {}".format(user)
#+END_EXAMPLE

用尖括号<>来包围具体的变量名，注意相应的函数应该接受这个参数（装饰器做了一个字典值环境，然后对下面的视图函数对应的变量名进行填充）。具体这个变量在函数中具体数据类型可以用 ~<int:id>~ 这样的形式来控制，默认是字符串类型。具体如下所示:

- string :: 接受任意文本除了url的斜线"/"。
- int :: 整型
- float :: 浮点型
- path :: 类似string，不过也可以接受斜线"/"

这里的视图函数是理解flask框架的关键，比如说后面要谈论的静态文件和模板文件，一个和视图函数内的具体引用有关，一个和视图函数具体输出有关。然后再后面要谈论的重定向和HTTP错误处理也不过是一些对一些特殊的情况进行了特殊的视图函数封装。而上面谈及，这个 ~@app.route~ 装饰器函数可以接受路径中的变量参数，其通过一个字典值环境变量传递进来，实际上这个字典值环境变量里面还有更多的东西，比如说客户浏览器HTTP的请求，将会封装成为一个request对象。这个 *request* 对象你在视图函数里面一样可以直接用。比如 ~request.headers~ 就是我们熟知的HTTP请求头文件的字典值。然后 ~request.headers.get('User-Agent')~ 你就可以获得输入HTTP请求头文件的"User-Agent" 这一行的值。

视图函数最后需要返回一个response对象，其可以是一个简单的字符串或者一个简单的网页文件，你也可以用 ~make_response~ 函数来构建自己的response对象。

*** 构建自己的刷url的参量类型
path类型已经可以接受斜线了，所以只适合某个子节点下面全是路径的情况，如 ~/dir/some/path~ ，因为后面所有的子节点都将传入到那个path参量上去。然后就是虽然flask也允许 ~/project/~ 这样的url，而且具体和 ~/project~ 是两个不同的url，我很不喜欢这种url，实际上我们应该完全避免 ~/~ 结尾的url的情况，包括restful api里面也是。

然后就是我们可以深度定制自己的刷url的参量类型。比如:
#+BEGIN_EXAMPLE
from werkzeug.routing import BaseConverter

class ListConverter(BaseConverter):
    def to_python(self, value):
        return value.split('+')

    def to_url(self, values):
        return '+'.join(BaseConverter.to_url(value)
            for value in values)

app.url_map.converters['list'] = ListConverter
#+END_EXAMPLE

主要就是向 ~url_map~ 的 ~converters~ 这个字典值里面添加你想要的额外的类型转换，这里是一个列表转换。你需要做的就是子类化 ~BaseConverter~ 这个类，然后定义好 ~to_python~ 和 ~to_url~ 这两个方法。具体一个是根据url刷python变量，另外一个是根据python量返回url中的字符串。

上面这个转换器大体实现了 ~/a+b~ 刷成 ['a','b'] ，然后反之。这个了解下即可，实在有需要才考虑使用，因为这种转换器是越少越好，写了一些自己的转换器混进去，会让你的程序代码更难读和更难理解，同时自己如果驾驭不好的，会出各种bug吧。


*** HTTP Methods
如下所示:
#+BEGIN_EXAMPLE
@app.route('/login', methods=['GET', 'POST'])
#+END_EXAMPLE
你可以在分发URL的时候，确定该URL要处理的一些HTTP方法。如果你不加上 *methods* 参数，那么默认是GET方法，而多个方法你需要如下来确定具体视图函数等下要处理的HTTP方法类型:
#+BEGIN_EXAMPLE
if request.method == 'POST':
#+END_EXAMPLE

这个 *request* 参量是每个视图函数自动都会接受的一个变量。这个 *request* 变量是个非常重要的概念，请看下面这个小例子:
#+BEGIN_SRC python
@app.route('/',methods=['GET','POST'])
def index():
    if request.method == 'GET':
        query = request.args.get('query')

        ...

        return render_template('index.html',**locals())
#+END_SRC

这里GET方法中URL传递的如 ~?key=value~ 这些参数对应的就是request对象的args这个字典值，然后你用get方法取之即可。


** url_for函数
~url_for~ 函数是一个很有用的函数，你在jinja2模板系统里面也是可以继续使用的。比如你定义的视图函数
#+BEGIN_EXAMPLE
@app.route('/')
def index():
    return 'hello'
#+END_EXAMPLE

该网页对应的路径就可以这样生成: ~url_for('index')~ 

再比如你定义的视图函数里面有参量:
#+BEGIN_EXAMPLE
@app.route('/user/<int:userid>')
def user(userid):
    return str(userid)
#+END_EXAMPLE
该视图函数对应的url请求路径是: ~url_for('user',userid=3)~

然后静态文件也可以用 ~url_for~ 来快速生成引用地址，这个在下面的静态文件一章里面有详细说明。

然后比如说利用 flask-restful 插件搭建你的restful api ，其中有个设置 ~endpoint~ 的参数，你可以用那里具体设置的endpoint的名字来对应该api的url，如:

#+BEGIN_EXAMPLE
api.add_resource(FoldersAPI,'/api/v1/folders',endpoint='folders')
#+END_EXAMPLE

对应的就是 ~url_for('folders')~ ，然后值得一提的是，这生成的是相对主站的相对路径，如这样的形式 ~/api/v1/folders~ ，我不清楚ajax技术会如何，但如果你使用requests模块来进行请求的话，则需要加上 ~_external~ 选项:
#+BEGIN_EXAMPLE
requests.get(url_for('get_subfolders',path=path,_external=True))
#+END_EXAMPLE

然后如果你加入的其他参数没有在url里面的话则会作为查询参数加入进构建的url中。
#+BEGIN_EXAMPLE
>>> @app.route('/login')
... def login(): pass
#+END_EXAMPLE
#+BEGIN_EXAMPLE
...  print url_for('login', next='/')
/login?next=/
#+END_EXAMPLE



