电脑/python/flask/精通flask.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-03-01 二 09:20 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>精通flask框架</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">精通flask框架</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. 前言</a>
<ul>
<li><a href="#orgheadline1">1.1. 第一个例子</a></li>
</ul>
</li>
<li><a href="#orgheadline27">2. flask基础</a>
<ul>
<li><a href="#orgheadline6">2.1. 路径分发和对应的视图函数</a>
<ul>
<li><a href="#orgheadline3">2.1.1. 路径分发带变量</a></li>
<li><a href="#orgheadline4">2.1.2. 构建自己的刷url的参量类型</a></li>
<li><a href="#orgheadline5">2.1.3. HTTP Methods</a></li>
</ul>
</li>
<li><a href="#orgheadline7">2.2. url_for函数</a></li>
<li><a href="#orgheadline8">2.3. request对象</a></li>
<li><a href="#orgheadline14">2.4. session对象和g对象和简单的登录机制</a>
<ul>
<li><a href="#orgheadline9">2.4.1. 测试用</a></li>
<li><a href="#orgheadline10">2.4.2. 应用添加数据库</a></li>
<li><a href="#orgheadline11">2.4.3. 应用用户登录识别</a></li>
<li><a href="#orgheadline12">2.4.4. secret_key的设置</a></li>
<li><a href="#orgheadline13">2.4.5. flash函数</a></li>
</ul>
</li>
<li><a href="#orgheadline15">2.5. app的配置</a></li>
<li><a href="#orgheadline16">2.6. jinja2模板</a></li>
<li><a href="#orgheadline17">2.7. 静态文件</a></li>
<li><a href="#orgheadline18">2.8. redirect函数</a></li>
<li><a href="#orgheadline23">2.9. abort函数抛出某个异常</a>
<ul>
<li><a href="#orgheadline19">2.9.1. 404 Not Found</a></li>
<li><a href="#orgheadline20">2.9.2. 403 Forbidden</a></li>
<li><a href="#orgheadline21">2.9.3. 410 Gone</a></li>
<li><a href="#orgheadline22">2.9.4. 500 Internal Server Error</a></li>
</ul>
</li>
<li><a href="#orgheadline24">2.10. 异常捕捉</a></li>
<li><a href="#orgheadline25">2.11. logger</a></li>
<li><a href="#orgheadline26">2.12. 文件上传</a></li>
</ul>
</li>
<li><a href="#orgheadline31">3. 组织你的项目</a>
<ul>
<li><a href="#orgheadline28">3.1. 配置文件的补充说明</a></li>
<li><a href="#orgheadline30">3.2. 使用蓝图来管理你的视图</a>
<ul>
<li><a href="#orgheadline29">3.2.1. url_prefix</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline32">4. 表单</a></li>
<li><a href="#orgheadline33">5. 用户管理规范</a></li>
<li><a href="#orgheadline40">6. restful api设计</a>
<ul>
<li><a href="#orgheadline37">6.1. restful api简介</a>
<ul>
<li><a href="#orgheadline34">6.1.1. REST软件架构风格</a></li>
<li><a href="#orgheadline35">6.1.2. REST系统设计规范</a></li>
<li><a href="#orgheadline36">6.1.3. RESTful API</a></li>
</ul>
</li>
<li><a href="#orgheadline38">6.2. 我对restful api的反思</a></li>
<li><a href="#orgheadline39">6.3. flask-restful插件</a></li>
</ul>
</li>
<li><a href="#orgheadline41">7. 缓存</a></li>
<li><a href="#orgheadline58">8. 附录</a>
<ul>
<li><a href="#orgheadline42">8.1. 用gunicorn和nginx配置</a></li>
<li><a href="#orgheadline51">8.2. 在heroku上部署项目</a>
<ul>
<li><a href="#orgheadline43">8.2.1. 指定python2或python3</a></li>
<li><a href="#orgheadline44">8.2.2. 安装第三方模块</a></li>
<li><a href="#orgheadline45">8.2.3. Procfile文件</a></li>
<li><a href="#orgheadline46">8.2.4. hello.py文件</a></li>
<li><a href="#orgheadline47">8.2.5. 安装heroku或者不？</a></li>
<li><a href="#orgheadline48">8.2.6. 通过网页新建项目得到一个好名字</a></li>
<li><a href="#orgheadline49">8.2.7. 或者更简单直接通过github来管理</a></li>
<li><a href="#orgheadline50">8.2.8. 如何在heroku上加入数据库</a></li>
</ul>
</li>
<li><a href="#orgheadline56">8.3. 和apache2一起</a>
<ul>
<li><a href="#orgheadline52">8.3.1. 简单的apache2配置</a></li>
<li><a href="#orgheadline53">8.3.2. Require做了什么</a></li>
<li><a href="#orgheadline54">8.3.3. what.wsgi文件</a></li>
<li><a href="#orgheadline55">8.3.4. 更复杂点的配置</a></li>
</ul>
</li>
<li><a href="#orgheadline57">8.4. 参考资料</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline2">前言</h2>
<div class="outline-text-2" id="text-1">
<p>
flask框架底层基于Werkzeug模块和jinja2模块，关于这两个模块的知识将另行讨论。当然本文一开始就假设读者至少已经算得上精通python语言了，然后对网络编程的一些基础知识已有所了解，那么我们继续吧。
</p>
</div>


<div class="outline-3">
<h3 id="orgheadline1">第一个例子</h3>
<div class="outline-text-3" id="text-1-1">
<p>
安装推荐就简单用pip2或pip3安装之，然后一个简单的helloworld例子如下所示，读者可以先运行一下看看flask框架安装上去了没有。
</p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">flask</span> <span class="kn">import</span> <span class="n">Flask</span>
<span class="n">app</span> <span class="o">=</span> <span class="n">Flask</span><span class="p">(</span><span class="n">__name__</span><span class="p">)</span>

<span class="nd">@app.route</span><span class="p">(</span><span class="s1">&#39;/&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">hello_world</span><span class="p">():</span>
    <span class="k">return</span> <span class="s1">&#39;Hello World!&#39;</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">app</span><span class="o">.</span><span class="n">run</span><span class="p">()</span>
</pre></div>

<p>
Flask类提供了所谓的Web Server Gateway Interface，也就是WSGI application。上面代码第一第二行基本上都是这样写的，其中Flask接受的 <code>__name__</code> 也就是本py文件作为模块被引入时的名字或者是当前执行py文件 <code>__main__</code> ，这样设置是方便flask找到静态文件（比如通过 <code>rend_template</code> 函数加载的模板文件，名字是index.html的，flask会在这个app所在的目录下的templates文件夹下面查找这个index.html文件。）等。
</p>

<p>
然后下面hello_world函数加上了装饰器 <code>@app.route('/')</code> ，意义是明显是在分发url路径。那么这个函数的返回将作为这个url路径的返回值。
</p>
</div>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline27">flask基础</h2>
<div class="outline-text-2" id="text-2">
</div><div class="outline-3">
<h3 id="orgheadline6">路径分发和对应的视图函数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在上面最简单的那个例子中，就已经包含了flask web框架的最核心部分。其包括如下任务: 第一，我们定义该网站的子路径（具体就是对应HTTP协议的GET方法）；第二，如果用户浏览器请求到该路径，那么我们应该给用户浏览器传回去点什么东西。
</p>

<p>
一般路径分发就是直接把子路径写上去即可，这自不用多说。下面演示分发路径带变量的情况: 
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline3">路径分发带变量</h4>
<div class="outline-text-4" id="text-2-1-1">
<pre>
@app.route('/user/&lt;user&gt;')
def get_user(user):
    return "user {}".format(user)
</pre>

<p>
用尖括号&lt;&gt;来包围具体的变量名，注意相应的函数应该接受这个参数（装饰器做了一个字典值环境，然后对下面的视图函数对应的变量名进行填充）。具体这个变量在函数中具体数据类型可以用 <code>&lt;int:id&gt;</code> 这样的形式来控制，默认是字符串类型。具体如下所示:
</p>

<dl class="org-dl">
<dt>string</dt><dd>接受任意文本除了url的斜线"/"。</dd>
<dt>int</dt><dd>整型</dd>
<dt>float</dt><dd>浮点型</dd>
<dt>path</dt><dd>类似string，不过也可以接受斜线"/"</dd>
</dl>

<p>
这里的视图函数是理解flask框架的关键，比如说后面要谈论的静态文件和模板文件，一个和视图函数内的具体引用有关，一个和视图函数具体输出有关。然后再后面要谈论的重定向和HTTP错误处理也不过是一些对一些特殊的情况进行了特殊的视图函数封装。而上面谈及，这个 <code>@app.route</code> 装饰器函数可以接受路径中的变量参数，其通过一个字典值环境变量传递进来，实际上这个字典值环境变量里面还有更多的东西，比如说客户浏览器HTTP的请求，将会封装成为一个request对象。这个 <strong>request</strong> 对象你在视图函数里面一样可以直接用。比如 <code>request.headers</code> 就是我们熟知的HTTP请求头文件的字典值。然后 <code>request.headers.get('User-Agent')</code> 你就可以获得输入HTTP请求头文件的"User-Agent" 这一行的值。
</p>

<p>
视图函数最后需要返回一个response对象，其可以是一个简单的字符串或者一个简单的网页文件，你也可以用 <code>make_response</code> 函数来构建自己的response对象。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline4">构建自己的刷url的参量类型</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
path类型已经可以接受斜线了，所以只适合某个子节点下面全是路径的情况，如 <code>/dir/some/path</code> ，因为后面所有的子节点都将传入到那个path参量上去。然后就是虽然flask也允许 <code>/project/</code> 这样的url，而且具体和 <code>/project</code> 是两个不同的url，我很不喜欢这种url，实际上我们应该完全避免 <code>/</code> 结尾的url的情况，包括restful api里面也是。
</p>

<p>
然后就是我们可以深度定制自己的刷url的参量类型。比如:
</p>
<pre>
from werkzeug.routing import BaseConverter

class ListConverter(BaseConverter):
    def to_python(self, value):
        return value.split('+')

    def to_url(self, values):
        return '+'.join(BaseConverter.to_url(value)
            for value in values)

app.url_map.converters['list'] = ListConverter
</pre>

<p>
主要就是向 <code>url_map</code> 的 <code>converters</code> 这个字典值里面添加你想要的额外的类型转换，这里是一个列表转换。你需要做的就是子类化 <code>BaseConverter</code> 这个类，然后定义好 <code>to_python</code> 和 <code>to_url</code> 这两个方法。具体一个是根据url刷python变量，另外一个是根据python量返回url中的字符串。
</p>

<p>
上面这个转换器大体实现了 <code>/a+b</code> 刷成 ['a','b'] ，然后反之。这个了解下即可，实在有需要才考虑使用，因为这种转换器是越少越好，写了一些自己的转换器混进去，会让你的程序代码更难读和更难理解，同时自己如果驾驭不好的，会出各种bug吧。
</p>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline5">HTTP Methods</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
如下所示:
</p>
<pre>
@app.route('/login', methods=['GET', 'POST'])
</pre>
<p>
你可以在分发URL的时候，确定该URL要处理的一些HTTP方法。如果你不加上 <strong>methods</strong> 参数，那么默认是GET方法，而多个方法你需要如下来确定具体视图函数等下要处理的HTTP方法类型:
</p>
<pre>
if request.method == 'POST':
</pre>

<p>
这个 <strong>request</strong> 参量是每个视图函数自动都会接受的一个变量。这个 <strong>request</strong> 变量是个非常重要的概念，请看下面这个小例子:
</p>
<div class="highlight"><pre><span></span><span class="nd">@app.route</span><span class="p">(</span><span class="s1">&#39;/&#39;</span><span class="p">,</span><span class="n">methods</span><span class="o">=</span><span class="p">[</span><span class="s1">&#39;GET&#39;</span><span class="p">,</span><span class="s1">&#39;POST&#39;</span><span class="p">])</span>
<span class="k">def</span> <span class="nf">index</span><span class="p">():</span>
    <span class="k">if</span> <span class="n">request</span><span class="o">.</span><span class="n">method</span> <span class="o">==</span> <span class="s1">&#39;GET&#39;</span><span class="p">:</span>
        <span class="n">query</span> <span class="o">=</span> <span class="n">request</span><span class="o">.</span><span class="n">args</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="s1">&#39;query&#39;</span><span class="p">)</span>

        <span class="o">...</span>

        <span class="k">return</span> <span class="n">render_template</span><span class="p">(</span><span class="s1">&#39;index.html&#39;</span><span class="p">,</span><span class="o">**</span><span class="nb">locals</span><span class="p">())</span>
</pre></div>

<p>
这里GET方法中URL传递的如 <code>?key=value</code> 这些参数对应的就是request对象的args这个字典值，然后你用get方法取之即可。
</p>
</div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline7">url_for函数</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>url_for</code> 函数是一个很有用的函数，你在jinja2模板系统里面也是可以继续使用的。比如你定义的视图函数
</p>
<pre>
@app.route('/')
def index():
    return 'hello'
</pre>

<p>
该网页对应的路径就可以这样生成: <code>url_for('index')</code> 
</p>

<p>
再比如你定义的视图函数里面有参量:
</p>
<pre>
@app.route('/user/&lt;int:userid&gt;')
def user(userid):
    return str(userid)
</pre>
<p>
该视图函数对应的url请求路径是: <code>url_for('user',userid=3)</code>
</p>

<p>
然后静态文件也可以用 <code>url_for</code> 来快速生成引用地址，这个在下面的静态文件一章里面有详细说明。
</p>

<p>
然后比如说利用 flask-restful 插件搭建你的restful api ，其中有个设置 <code>endpoint</code> 的参数，你可以用那里具体设置的endpoint的名字来对应该api的url，如:
</p>

<pre>
api.add_resource(FoldersAPI,'/api/v1/folders',endpoint='folders')
</pre>

<p>
对应的就是 <code>url_for('folders')</code> ，然后值得一提的是，这生成的是相对主站的相对路径，如这样的形式 <code>/api/v1/folders</code> ，我不清楚ajax技术会如何，但如果你使用requests模块来进行请求的话，则需要加上 <code>_external</code> 选项:
</p>
<pre>
requests.get(url_for('get_subfolders',path=path,_external=True))
</pre>

<p>
然后如果你加入的其他参数没有在url里面的话则会作为查询参数加入进构建的url中。
</p>
<pre>
&gt;&gt;&gt; @app.route('/login')
... def login(): pass
</pre>
<pre>
...  print url_for('login', next='/')
/login?next=/
</pre>
</div>
</div>
