电脑/python/flask/精通flask.org
** request对象
因为request对象在flask框架中非常重要，而且里面的变量的值flask都会自动帮你处理好，下面详细介绍之（更多信息请参看[[https://flask.readthedocs.org/en/latest/api/#flask.Request][这里]]）:

request对象是一个请求上下文环境下的变量，也就是每一个不同的请求request变量的值都不同、

- form :: 在网页表单中通过定义 ~value~ 可以获得一个变量，具体填入的值可以通过 ~request.form.get('what')~ 来获得。 
- files :: 网页表单中上传文件的input ~type=file~ 将传到这里。具体返回对象和python的文件对象类似，除了还提供额外的 ~save~ 方法用于保存文件。
- args :: 就是URL中各个参数。
- values :: 相当于上面谈及的form和args这两个字典的合并字典

- cookies :: 一个字典值，request传输的cookies值 
- headers :: 字典值，request请求的headers


- get_json :: request的data如果mimetype是json时（ ~application/json~ ），接受之后会自动刷成字典值。如果设置 ~force=True~ ，那么就算mimetype不是json也如此强制执行。
- is_json :: 判断请求发送的数据是否是json格式。
- data :: 处理request过来的data，如果请求体发送过来的mimetype是json，那么推荐用 ~get_json~ 方法来处理之。否则用这个 ~request.data~ 将不做任何处理只是返回字符串。

- max_content_length :: HTTP协议里面的 ~MAX_CONTENT_LENGTH~ 字段值，也就是发送的content的size。具体文件上传情况和json处理情况后面到时再详细讨论之。
- method :: POST GET等 
- path :: 具体分发的路径，也就是 ~@route~ 的第一个参数。这里值得一提的是如果用gunicorn和nginx这样的架构，具体server_name的解析会出错，如果你想要表达当前url，用 ~request.url~ 可能不是你希望的结果，推荐使用 ~request.path~ 这样的相对表达方式。
- url :: 完整url


** session对象和g对象和简单的登录机制
每一个请求都会自动新建一个request对象，这是容易理解的，此外每一个视图函数里面还可以使用 ~flask.session~ 和 ~flask.g~ 这两个变量。要深刻理解这两个变量就需要理解flask的两种环境: 应用环境和请求环境。

我们看到flask与之相关的 ~globals.py~ 的源码:
#+BEGIN_SRC python
from functools import partial
from werkzeug.local import LocalStack, LocalProxy

def _lookup_req_object(name):
    top = _request_ctx_stack.top
    if top is None:
        raise RuntimeError(_request_ctx_err_msg)
    return getattr(top, name)


def _lookup_app_object(name):
    top = _app_ctx_stack.top
    if top is None:
        raise RuntimeError(_app_ctx_err_msg)
    return getattr(top, name)


def _find_app():
    top = _app_ctx_stack.top
    if top is None:
        raise RuntimeError(_app_ctx_err_msg)
    return top.app


# context locals
_request_ctx_stack = LocalStack()
_app_ctx_stack = LocalStack()
current_app = LocalProxy(_find_app)
request = LocalProxy(partial(_lookup_req_object, 'request'))
session = LocalProxy(partial(_lookup_req_object, 'session'))
g = LocalProxy(partial(_lookup_app_object, 'g'))
#+END_SRC

首先我们看到 ~from werkzeug.local import LocalStack, LocalProxy~ ，那里有解释信息:

#+BEGIN_QUOTE
The Python standard library has a concept called “thread locals” (or thread-local data). A thread local is a global object in which you can put stuff in and get back later in a thread-safe and thread-specific way. That means that whenever you set or get a value on a thread local object, the thread local object checks in which thread you are and retrieves the value corresponding to your thread (if one exists). So, you won’t accidentally get another thread’s data.
#+END_QUOTE

他说的意思是python就有一个 ~线程本地~ 的概念，也就是在该线程内的全局变量。然后 ~werkzeug~ 提到:
#+BEGIN_QUOTE
Werkzeug provides its own implementation of local data storage called werkzeug.local. This approach provides a similar functionality to thread locals but also works with greenlets.
#+END_QUOTE

也就是 ~werkzeug~ 提供了他自己的线程全局变量支持，其同时也支持 ~greenlets~ 。这里使用到的 ~LocalStack~ 和 ~LocalProxy~ 类我们不需要深入了解，一个是堆栈结构有push , pop 方法之类的，一个有类似字典的api。然后flask就是利用这两个类来建立了两个环境: 两个线程本地全局变量。 一个是应用环境，一个是请求环境。

其中session , request 这两个变量是于请求环境堆栈的，也就是每一个新到的请求都是重新创建的。然后 current_app 和 g 是位于应用环境堆栈的，新建的app都是重新创建的。flask是支持多线程模式的，如这样设置 ~app.run(threaded=True)~ ，这样每一个线程都有各自的 ~flask.g~ ，然后flask是通过 ~current_app~ 来获取当前app的。请参看 [[https://stackoverflow.com/questions/14672753/handling-multiple-requests-in-flask][这个网页]] ，推荐还是用 ~gunicorn~ 来解决多线程多请求问题。一般这种需求不太明显的，除非你的网站流量请求特别大了，但如果你的app有特别费时的IO，比如上传或下载大型文件，那么就可能阻塞整个app，这个时候就必须用gunicorn做多线程了。

好吧，为了简单起见我们用 ~gunicorn~ 来管理多线程，然后flask内部我们认为一个app，一个线程，则这个 ~flask.g~ 就可以看作一个方便的全局变量管理方式。而 ~request~ 和 ~session~ 则是每次请求都不同的，至于 ~session~ 其每次请求环境搭建时都会自动加载你的 cookies，大体就是这样。


*** 测试用
在测试的时候你需要自己创建一个应用上下文环境，然后请求通过requests模块来做。如下所示，调用 ~app.app_content()~ :

#+BEGIN_EXAMPLE
from flask import Flask, current_app

app = Flask(__name__)
with app.app_context():
    # within this block, current_app points to app.
    print current_app.name
#+END_EXAMPLE


*** 应用添加数据库
这个例子来自官方文档:
#+BEGIN_EXAMPLE
import sqlite3
from flask import g

def get_db():
    db = getattr(g, '_database', None)
    if db is None:
        db = g._database = connect_to_database()
    return db

@app.teardown_appcontext
def teardown_db(exception):
    db = getattr(g, '_database', None)
    if db is not None:
        db.close()
#+END_EXAMPLE

这里的 ~@app.teardown_appcontent~ 用于上下文环境销毁时需要额外做的动作。


*** 应用用户登录识别

#+BEGIN_EXAMPLE
@app.before_request
def get_current_user():
    g.user = None
    email = session.get('email')
    if email is not None:
        g.user = email
#+END_EXAMPLE

这里的逻辑是每次请求先都初始化 ~g.user~ ，然后尝试从session中获取cookies中保存的用户的值。

*** secret_key的设置
你需要为你的session的cookies设置一个密钥，就像这样:
#+BEGIN_EXAMPLE
app.secret_key = 'what...'
#+END_EXAMPLE

可以通过这样获得:
#+BEGIN_EXAMPLE
>>> import os
>>> os.urandom(24)
#+END_EXAMPLE

具体登录的例子请参看  [[https://github.com/a358003542/flask-examples][flask-examples]] 的 ~session.py~ 。



*** flash函数
具体登录的例子请参看  [[https://github.com/a358003542/flask-examples][flask-examples]] 的 ~session_flash.py~ 。

首先在python脚本中通过 ~flash~ 函数刷如一些信息，然后在 ~render_template~ 函数在处理模板的时候，request那个参量也传递进去了，这里不是重点。重点是 ~get_flashed_messages~ 这个函数也传递进去了，这里就是利用这个函数在jinja2模板中获取flash进入的那些信息，这个函数返回的是一个可迭代对象（可能就是一个列表吧）。




