电脑/python/flask/精通flask.html



<div class="outline-3">
<h3 id="orgheadline8">request对象</h3>
<div class="outline-text-3" id="text-2-3">
<p>
因为request对象在flask框架中非常重要，而且里面的变量的值flask都会自动帮你处理好，下面详细介绍之（更多信息请参看<a href="https://flask.readthedocs.org/en/latest/api/#flask.Request">这里</a>）:
</p>

<p>
request对象是一个请求上下文环境下的变量，也就是每一个不同的请求request变量的值都不同、
</p>

<dl class="org-dl">
<dt>form</dt><dd>在网页表单中通过定义 <code>value</code> 可以获得一个变量，具体填入的值可以通过 <code>request.form.get('what')</code> 来获得。</dd>
<dt>files</dt><dd>网页表单中上传文件的input <code>type=file</code> 将传到这里。具体返回对象和python的文件对象类似，除了还提供额外的 <code>save</code> 方法用于保存文件。</dd>
<dt>args</dt><dd>就是URL中各个参数。</dd>
<dt>values</dt><dd>相当于上面谈及的form和args这两个字典的合并字典</dd>

<dt>cookies</dt><dd>一个字典值，request传输的cookies值</dd>
<dt>headers</dt><dd>字典值，request请求的headers</dd>
</dl>


<dl class="org-dl">
<dt>get_json</dt><dd>request的data如果mimetype是json时（ <code>application/json</code> ），接受之后会自动刷成字典值。如果设置 <code>force=True</code> ，那么就算mimetype不是json也如此强制执行。</dd>
<dt>is_json</dt><dd>判断请求发送的数据是否是json格式。</dd>
<dt>data</dt><dd>处理request过来的data，如果请求体发送过来的mimetype是json，那么推荐用 <code>get_json</code> 方法来处理之。否则用这个 <code>request.data</code> 将不做任何处理只是返回字符串。</dd>

<dt>max_content_length</dt><dd>HTTP协议里面的 <code>MAX_CONTENT_LENGTH</code> 字段值，也就是发送的content的size。具体文件上传情况和json处理情况后面到时再详细讨论之。</dd>
<dt>method</dt><dd>POST GET等</dd>
<dt>path</dt><dd>具体分发的路径，也就是 <code>@route</code> 的第一个参数。这里值得一提的是如果用gunicorn和nginx这样的架构，具体server_name的解析会出错，如果你想要表达当前url，用 <code>request.url</code> 可能不是你希望的结果，推荐使用 <code>request.path</code> 这样的相对表达方式。</dd>
<dt>url</dt><dd>完整url</dd>
</dl>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline14">session对象和g对象和简单的登录机制</h3>
<div class="outline-text-3" id="text-2-4">
<p>
每一个请求都会自动新建一个request对象，这是容易理解的，此外每一个视图函数里面还可以使用 <code>flask.session</code> 和 <code>flask.g</code> 这两个变量。要深刻理解这两个变量就需要理解flask的两种环境: 应用环境和请求环境。
</p>

<p>
我们看到flask与之相关的 <code>globals.py</code> 的源码:
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">functools</span> <span class="kn">import</span> <span class="n">partial</span>
<span class="kn">from</span> <span class="nn">werkzeug.local</span> <span class="kn">import</span> <span class="n">LocalStack</span><span class="p">,</span> <span class="n">LocalProxy</span>

<span class="k">def</span> <span class="nf">_lookup_req_object</span><span class="p">(</span><span class="n">name</span><span class="p">):</span>
    <span class="n">top</span> <span class="o">=</span> <span class="n">_request_ctx_stack</span><span class="o">.</span><span class="n">top</span>
    <span class="k">if</span> <span class="n">top</span> <span class="ow">is</span> <span class="bp">None</span><span class="p">:</span>
        <span class="k">raise</span> <span class="ne">RuntimeError</span><span class="p">(</span><span class="n">_request_ctx_err_msg</span><span class="p">)</span>
    <span class="k">return</span> <span class="nb">getattr</span><span class="p">(</span><span class="n">top</span><span class="p">,</span> <span class="n">name</span><span class="p">)</span>


<span class="k">def</span> <span class="nf">_lookup_app_object</span><span class="p">(</span><span class="n">name</span><span class="p">):</span>
    <span class="n">top</span> <span class="o">=</span> <span class="n">_app_ctx_stack</span><span class="o">.</span><span class="n">top</span>
    <span class="k">if</span> <span class="n">top</span> <span class="ow">is</span> <span class="bp">None</span><span class="p">:</span>
        <span class="k">raise</span> <span class="ne">RuntimeError</span><span class="p">(</span><span class="n">_app_ctx_err_msg</span><span class="p">)</span>
    <span class="k">return</span> <span class="nb">getattr</span><span class="p">(</span><span class="n">top</span><span class="p">,</span> <span class="n">name</span><span class="p">)</span>


<span class="k">def</span> <span class="nf">_find_app</span><span class="p">():</span>
    <span class="n">top</span> <span class="o">=</span> <span class="n">_app_ctx_stack</span><span class="o">.</span><span class="n">top</span>
    <span class="k">if</span> <span class="n">top</span> <span class="ow">is</span> <span class="bp">None</span><span class="p">:</span>
        <span class="k">raise</span> <span class="ne">RuntimeError</span><span class="p">(</span><span class="n">_app_ctx_err_msg</span><span class="p">)</span>
    <span class="k">return</span> <span class="n">top</span><span class="o">.</span><span class="n">app</span>


<span class="c1"># context locals</span>
<span class="n">_request_ctx_stack</span> <span class="o">=</span> <span class="n">LocalStack</span><span class="p">()</span>
<span class="n">_app_ctx_stack</span> <span class="o">=</span> <span class="n">LocalStack</span><span class="p">()</span>
<span class="n">current_app</span> <span class="o">=</span> <span class="n">LocalProxy</span><span class="p">(</span><span class="n">_find_app</span><span class="p">)</span>
<span class="n">request</span> <span class="o">=</span> <span class="n">LocalProxy</span><span class="p">(</span><span class="n">partial</span><span class="p">(</span><span class="n">_lookup_req_object</span><span class="p">,</span> <span class="s1">&#39;request&#39;</span><span class="p">))</span>
<span class="n">session</span> <span class="o">=</span> <span class="n">LocalProxy</span><span class="p">(</span><span class="n">partial</span><span class="p">(</span><span class="n">_lookup_req_object</span><span class="p">,</span> <span class="s1">&#39;session&#39;</span><span class="p">))</span>
<span class="n">g</span> <span class="o">=</span> <span class="n">LocalProxy</span><span class="p">(</span><span class="n">partial</span><span class="p">(</span><span class="n">_lookup_app_object</span><span class="p">,</span> <span class="s1">&#39;g&#39;</span><span class="p">))</span>
</pre></div>

<p>
首先我们看到 <code>from werkzeug.local import LocalStack, LocalProxy</code> ，那里有解释信息:
</p>

<blockquote>
<p>
The Python standard library has a concept called “thread locals” (or thread-local data). A thread local is a global object in which you can put stuff in and get back later in a thread-safe and thread-specific way. That means that whenever you set or get a value on a thread local object, the thread local object checks in which thread you are and retrieves the value corresponding to your thread (if one exists). So, you won’t accidentally get another thread’s data.
</p>
</blockquote>

<p>
他说的意思是python就有一个 <code>线程本地</code> 的概念，也就是在该线程内的全局变量。然后 <code>werkzeug</code> 提到:
</p>
<blockquote>
<p>
Werkzeug provides its own implementation of local data storage called werkzeug.local. This approach provides a similar functionality to thread locals but also works with greenlets.
</p>
</blockquote>

<p>
也就是 <code>werkzeug</code> 提供了他自己的线程全局变量支持，其同时也支持 <code>greenlets</code> 。这里使用到的 <code>LocalStack</code> 和 <code>LocalProxy</code> 类我们不需要深入了解，一个是堆栈结构有push , pop 方法之类的，一个有类似字典的api。然后flask就是利用这两个类来建立了两个环境: 两个线程本地全局变量。 一个是应用环境，一个是请求环境。
</p>

<p>
其中session , request 这两个变量是于请求环境堆栈的，也就是每一个新到的请求都是重新创建的。然后 current_app 和 g 是位于应用环境堆栈的，新建的app都是重新创建的。flask是支持多线程模式的，如这样设置 <code>app.run(threaded=True)</code> ，这样每一个线程都有各自的 <code>flask.g</code> ，然后flask是通过 <code>current_app</code> 来获取当前app的。请参看 <a href="https://stackoverflow.com/questions/14672753/handling-multiple-requests-in-flask">这个网页</a> ，推荐还是用 <code>gunicorn</code> 来解决多线程多请求问题。一般这种需求不太明显的，除非你的网站流量请求特别大了，但如果你的app有特别费时的IO，比如上传或下载大型文件，那么就可能阻塞整个app，这个时候就必须用gunicorn做多线程了。
</p>

<p>
好吧，为了简单起见我们用 <code>gunicorn</code> 来管理多线程，然后flask内部我们认为一个app，一个线程，则这个 <code>flask.g</code> 就可以看作一个方便的全局变量管理方式。而 <code>request</code> 和 <code>session</code> 则是每次请求都不同的，至于 <code>session</code> 其每次请求环境搭建时都会自动加载你的 cookies，大体就是这样。
</p>
</div>


<div class="outline-4">
<h4 id="orgheadline9">测试用</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
在测试的时候你需要自己创建一个应用上下文环境，然后请求通过requests模块来做。如下所示，调用 <code>app.app_content()</code> :
</p>

<pre>
from flask import Flask, current_app

app = Flask(__name__)
with app.app_context():
    # within this block, current_app points to app.
    print current_app.name
</pre>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline10">应用添加数据库</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
这个例子来自官方文档:
</p>
<pre>
import sqlite3
from flask import g

def get_db():
    db = getattr(g, '_database', None)
    if db is None:
        db = g._database = connect_to_database()
    return db

@app.teardown_appcontext
def teardown_db(exception):
    db = getattr(g, '_database', None)
    if db is not None:
        db.close()
</pre>

<p>
这里的 <code>@app.teardown_appcontent</code> 用于上下文环境销毁时需要额外做的动作。
</p>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline11">应用用户登录识别</h4>
<div class="outline-text-4" id="text-2-4-3">
<pre>
@app.before_request
def get_current_user():
    g.user = None
    email = session.get('email')
    if email is not None:
        g.user = email
</pre>

<p>
这里的逻辑是每次请求先都初始化 <code>g.user</code> ，然后尝试从session中获取cookies中保存的用户的值。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline12">secret_key的设置</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
你需要为你的session的cookies设置一个密钥，就像这样:
</p>
<pre>
app.secret_key = 'what...'
</pre>

<p>
可以通过这样获得:
</p>
<pre>
&gt;&gt;&gt; import os
&gt;&gt;&gt; os.urandom(24)
</pre>

<p>
具体登录的例子请参看  <a href="https://github.com/a358003542/flask-examples">flask-examples</a> 的 <code>session.py</code> 。
</p>
</div>
</div>



<div class="outline-4">
<h4 id="orgheadline13">flash函数</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
具体登录的例子请参看  <a href="https://github.com/a358003542/flask-examples">flask-examples</a> 的 <code>session_flash.py</code> 。
</p>

<p>
首先在python脚本中通过 <code>flash</code> 函数刷如一些信息，然后在 <code>render_template</code> 函数在处理模板的时候，request那个参量也传递进去了，这里不是重点。重点是 <code>get_flashed_messages</code> 这个函数也传递进去了，这里就是利用这个函数在jinja2模板中获取flash进入的那些信息，这个函数返回的是一个可迭代对象（可能就是一个列表吧）。
</p>
</div>
</div>
</div>
