电脑/python/flask/精通flask.org
** app的配置
前面也接触过一些了，比如 ~app.config['DEBUG'] = True~ ，这个 ~app.config~ 是一个类似字典对象的对象。一些重要的配置下面列出来，更多的请参看 [[http://docs.jinkan.org/docs/flask/config.html][这个网页]] 。

- DEBUG :: 调试模式
- SECRET_KEY :: 密钥
- SERVER_NAME :: 服务器名和端口，如果你想让flask支持子域名，则需要设置这个。
- SEND_FILE_MAX_AGE_DEFAULT :: 缓存控制的最大期限，默认是12小时。
- MAX_CONTENT_LENGTH :: 最大content长度，当你需要上传和下载文件的时候，最好把这个设置得大一点。




** jinja2模板
具体jinja2模块的基本知识这里就不说了，这里主要说一下jinja2模板系统在flask框架中额外的东西。

1. config

request
当模版不是在活动的请求上下文中渲染时这个变量不可用。
session

当模版不是在活动的请求上下文中渲染时这个变量不可用。

g
当模版不是在活动的请求上下文中渲染时这个变量不可用。

url_for()
flask.url_for() 函数

get_flashed_messages()
flask.get_flashed_messages() 函数


** 静态文件
静态文件有很多解决方案，比如说在你的flask项目里面新建一个 *static* 文件夹，然后在css文件夹里面要引用"boostrap.min.css"文件，那么可以在模板文件中如下引用之:
#+BEGIN_EXAMPLE
  <link rel="stylesheet" href="{{ url_for('static',filename='css/bootstrap.min.css') }}">
#+END_EXAMPLE

如果你打开网页，可以看作最终生成的实际是这样的形式:
#+BEGIN_EXAMPLE
<link rel="stylesheet" href="/static/css/bootstrap.min.css">
#+END_EXAMPLE

其他文件的引用大致类似。

然后就是模板文件，你需要在你的flask项目中新建一个 *templates* 文件，然后在里面新建一个index.html文件，那么通过 ~render_template~ 渲染该文件时你只需要写上"index.html"文件即可，具体如下所示:
#+BEGIN_EXAMPLE
render_template('index.html')
#+END_EXAMPLE

~render_template~ 函数后面接受的参数都将刷入模板系统，一个不错的做法如下所示:
#+BEGIN_EXAMPLE
render_template('index.html', **locals())
#+END_EXAMPLE
这样将把本视图函数中所有的本地变量都刷进去，毕竟模板文件有时要刷如的参量太多了，要一个个写实在太麻烦了。


** redirect函数
页面重定向函数。
#+BEGIN_EXAMPLE
@app.route('/')
def index():
    return redirect(url_for('login'))
#+END_EXAMPLE


** abort函数抛出某个异常
抛出某个HTTP状态异常
#+BEGIN_EXAMPLE
abort(404)
#+END_EXAMPLE


*** 404 Not Found
经典的“哎呦，您输入的 URL 当中有错误”消息。这个消息太常见了，即使是 互联网的新手也知道 404 代号的意义: 该死，我寻找的东西不在那儿。确保 404 页面上有一些有用的信息是一个好主意，至少应该提供一个返回主页的链接。

*** 403 Forbidden
如果您的网站包含一些类型的访问控制，您必须向非法的请求返回 403 错误代号。 所以请确保用户不会在试图访问了一个禁止访问的资源后不知所措。

*** 410 Gone
您知道 404 Not Found 代号还有一个兄弟名为 410 Gone 么? 很少有人真正实现 它，您可以考虑将其返回给对以前曾经存在、但是现在已经删除的资源的请求，而 不是直接返回 404 。 如果您还没有从数据库里永久删除这个文档，仅仅是将他们 标记为删除。那么可以为用户展示一个消息，说明他们寻找的东西已经永远删除了。

*** 500 Internal Server Error
通常在出现编程错误或者服务器过载的时候会返回这个错误代号。在这里放一个 漂亮的页面是一个非常好的主意。因为您的应用 总有一天 会出现错误(请参考 记录应用错误 )

** 异常捕捉
如下所示:
#+BEGIN_SRC python
@app.errorhandler(404)
def page_not_found(error):
    return render_template('404.html'), 404
#+END_SRC



** logger
#+BEGIN_EXAMPLE
app.logger.debug('A value for debugging')
#+END_EXAMPLE



** 文件上传
具体例子请参看我写的 [[https://github.com/a358003542/flask-examples][flask-examples]] 那里，具体是 upload.py 。


* 组织你的项目
这里主要讨论更加成熟和稍微复杂点的那种做法。这个参看 [[http://spacewander.github.io/explore-flask-zh/4-organizing_your_project.html][这个网页]] 。

#+BEGIN_EXAMPLE
run.py
config.py
instance/
  /config.py
project/
  /__init__.py
  /views.py
  /models.py
  /forms.py
  /static/
  /templates/
#+END_EXAMPLE

~run.py~ 是作为启动开发服务器的脚本，里面内容一般很简单，大体是:
#+BEGIN_SRC python
from project import app

if __name__ == '__main__':
    app.run()
#+END_SRC

这样运行根据后面讲到的两个 ~config.py~ 的不同的设置来获得开发和工作不同的配置环境。比如这里具体是先加载顶层目录的config.py，然后再加载instance里面的config.py
#+BEGIN_EXAMPLE
config loaded
instance config loaded
 * Debugger is active!
 * Debugger pin code: 916-109-430
#+END_EXAMPLE


然后 ~instance/config.py~ 里面一般放着密钥，不纳入git版本控制，具体就是在 ~.gitignore~ 文件里面加入 ~instance/~ 。这样的话为了保证远程服务器那边能够正常运行，你需要在那边手工添加这个文件夹和文件，然后在里面加入你的密钥。因为其没有进入版本控制，所以我们还需要加入另外一个不太重要的 ~config.py~ 文件，其放着关于flask app的不太重要的一些配置信息。然后推荐最后确认加上 ~debug=False~ ，确保生产环境debug模式没有打开。

在project文件夹里面， ~static~ 文件夹和 ~templates~ 文件夹就如上这样放置，然后通过 ~run.py~ 来运行是可以正常启动的。而在生产环境下，比如通过gunicorn来启动flask的app，则执行如下命令:

#+BEGIN_EXAMPLE
gunicorn -w 4 -b localhost:8001 project:app
#+END_EXAMPLE

这样将直接调用你的project里面的app对象，并且没有打开debug。

~config.py~ 和instance里面的config我们如下引入进来，具体在project的 ~__init__.py~ 里面:
#+BEGIN_EXAMPLE
from flask import *
app = Flask(__name__, instance_relative_config=True)
app.config.from_object('config')
app.config.from_pyfile('config.py')
#+END_EXAMPLE
其中 ~instance_relative_config=True~ 和 ~app.config.from_pyfile('config.py')~ 来引入instance文件夹里面的 ~config.py~ ，然后 ~app.config.from_object('config')~ 引入顶层目录下的 ~config.py~ 。

然后 ~views.py~ 和 ~models.py~ 里面的含义是很明显的，其中models.py里面一般定义一些数据库的模型，这个在project里面直接引入进来即可，而在 ~views.py~ 里面定义的一些视图函数我们也需要引入进来。这里值得一提的就是相对引入的用法:

在project的 ~__init__.py~ 里面有:
#+BEGIN_EXAMPLE
#### more views
from .views import *
#+END_EXAMPLE

在 ~views.py~ 里面有:
#+BEGIN_EXAMPLE
from flask import *
from . import app

@app.route('/')
def index():
    return render_template('index.html', **locals())
#+END_EXAMPLE

这种相对引入语法不支持直接运行脚本了，而需要在外面，通过 ~run.py~ 来运行，然后gunicorn那边也一切运行正常。

** 配置文件的补充说明
上面提及的 ~config.py~ 里面大体放着这种形式的配置信息:
#+BEGIN_EXAMPLE
DEBUG = True
#+END_EXAMPLE

然后我们知道关于这些配置变量我们都可以通过 ~app.config['WHAT']~ 来加载。

上面提及的:
#+BEGIN_EXAMPLE
app.config.from_object('config')
app.config.from_pyfile('config.py')
#+END_EXAMPLE

先加载顶层目录的 ~config.py~ 然后再加载instance下的 ~config.py~ 。这样将形成一种覆盖机制，按照 [[http://spacewander.github.io/explore-flask-zh/5-configuration.html][这个网页]] 的描述，我们可以在顶层设置:
#+BEGIN_EXAMPLE
DEBUG = False
SQLALCHEMY_ECHO = False
#+END_EXAMPLE

然后instance那边设置:
#+BEGIN_EXAMPLE
DEBUG = True
SQLALCHEMY_ECHO = True
#+END_EXAMPLE

生产环境那边将这两行不加上即可。

** 使用蓝图来管理你的视图
随着你的项目变大，你可能需要使用蓝图来重构你的项目代码。蓝图有两种风格，一种是功能式架构，只是简单的新建一个视图views文件夹，然后在里面放着你的蓝图或说视图定义；另一种是各自独立的分区式，视图，模板，静态文件都在某个文件夹下面。这里只讨论稍显简单的功能式架构。

最简单的一个蓝图定义文件如下所示:
#+BEGIN_SRC python
from flask import *
from .. import app

index = Blueprint('index', __name__)

@index.route('/')
def view_index():
    return render_template('index.html', **locals())
#+END_SRC

大体和之前接触的flask的视图函数定义类似，只是额外新建了一个Blueprint对象，然后使用 ~@index.route()~ 这样的装饰器来装饰该蓝图的视图函数。

然后在project也就是 ~__init__.py~ 文件那里，把这个蓝图注册进来。

#+BEGIN_SRC python
from .views.index import index
app.register_blueprint(index)
#+END_SRC

最基本的情况就是这样，其他一切照旧。

*** url_prefix
~url_prefix~ 是你定义一个Blueprint对象是很有用的一个可选参数，意义很明显，就是该蓝图下所有的url都加上了这个前缀。


* 表单
请参看 [[file:flask-wtf.html][flask-wtf]] 一文。


