电脑/python/flask/精通flask.html




<div class="outline-3">
<h3 id="orgheadline15">app的配置</h3>
<div class="outline-text-3" id="text-2-5">
<p>
前面也接触过一些了，比如 <code>app.config['DEBUG'] = True</code> ，这个 <code>app.config</code> 是一个类似字典对象的对象。一些重要的配置下面列出来，更多的请参看 <a href="http://docs.jinkan.org/docs/flask/config.html">这个网页</a> 。
</p>

<dl class="org-dl">
<dt>DEBUG</dt><dd>调试模式</dd>
<dt>SECRET_KEY</dt><dd>密钥</dd>
<dt>SERVER_NAME</dt><dd>服务器名和端口，如果你想让flask支持子域名，则需要设置这个。</dd>
<dt>SEND_FILE_MAX_AGE_DEFAULT</dt><dd>缓存控制的最大期限，默认是12小时。</dd>
<dt>MAX_CONTENT_LENGTH</dt><dd>最大content长度，当你需要上传和下载文件的时候，最好把这个设置得大一点。</dd>
</dl>
</div>
</div>




<div class="outline-3">
<h3 id="orgheadline16">jinja2模板</h3>
<div class="outline-text-3" id="text-2-6">
<p>
具体jinja2模块的基本知识这里就不说了，这里主要说一下jinja2模板系统在flask框架中额外的东西。
</p>

<ol class="org-ol">
<li>config</li>
</ol>

<p>
request
当模版不是在活动的请求上下文中渲染时这个变量不可用。
session
</p>

<p>
当模版不是在活动的请求上下文中渲染时这个变量不可用。
</p>

<p>
g
当模版不是在活动的请求上下文中渲染时这个变量不可用。
</p>

<p>
url_for()
flask.url_for() 函数
</p>

<p>
get_flashed_messages()
flask.get_flashed_messages() 函数
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline17">静态文件</h3>
<div class="outline-text-3" id="text-2-7">
<p>
静态文件有很多解决方案，比如说在你的flask项目里面新建一个 <strong>static</strong> 文件夹，然后在css文件夹里面要引用"boostrap.min.css"文件，那么可以在模板文件中如下引用之:
</p>
<pre>
&lt;link rel="stylesheet" href="{{ url_for('static',filename='css/bootstrap.min.css') }}"&gt;
</pre>

<p>
如果你打开网页，可以看作最终生成的实际是这样的形式:
</p>
<pre>
&lt;link rel="stylesheet" href="/static/css/bootstrap.min.css"&gt;
</pre>

<p>
其他文件的引用大致类似。
</p>

<p>
然后就是模板文件，你需要在你的flask项目中新建一个 <strong>templates</strong> 文件，然后在里面新建一个index.html文件，那么通过 <code>render_template</code> 渲染该文件时你只需要写上"index.html"文件即可，具体如下所示:
</p>
<pre>
render_template('index.html')
</pre>

<p>
<code>render_template</code> 函数后面接受的参数都将刷入模板系统，一个不错的做法如下所示:
</p>
<pre>
render_template('index.html', **locals())
</pre>
<p>
这样将把本视图函数中所有的本地变量都刷进去，毕竟模板文件有时要刷如的参量太多了，要一个个写实在太麻烦了。
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline18">redirect函数</h3>
<div class="outline-text-3" id="text-2-8">
<p>
页面重定向函数。
</p>
<pre>
@app.route('/')
def index():
    return redirect(url_for('login'))
</pre>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline23">abort函数抛出某个异常</h3>
<div class="outline-text-3" id="text-2-9">
<p>
抛出某个HTTP状态异常
</p>
<pre>
abort(404)
</pre>
</div>


<div class="outline-4">
<h4 id="orgheadline19">404 Not Found</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
经典的“哎呦，您输入的 URL 当中有错误”消息。这个消息太常见了，即使是 互联网的新手也知道 404 代号的意义: 该死，我寻找的东西不在那儿。确保 404 页面上有一些有用的信息是一个好主意，至少应该提供一个返回主页的链接。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline20">403 Forbidden</h4>
<div class="outline-text-4" id="text-2-9-2">
<p>
如果您的网站包含一些类型的访问控制，您必须向非法的请求返回 403 错误代号。 所以请确保用户不会在试图访问了一个禁止访问的资源后不知所措。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline21">410 Gone</h4>
<div class="outline-text-4" id="text-2-9-3">
<p>
您知道 404 Not Found 代号还有一个兄弟名为 410 Gone 么? 很少有人真正实现 它，您可以考虑将其返回给对以前曾经存在、但是现在已经删除的资源的请求，而 不是直接返回 404 。 如果您还没有从数据库里永久删除这个文档，仅仅是将他们 标记为删除。那么可以为用户展示一个消息，说明他们寻找的东西已经永远删除了。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline22">500 Internal Server Error</h4>
<div class="outline-text-4" id="text-2-9-4">
<p>
通常在出现编程错误或者服务器过载的时候会返回这个错误代号。在这里放一个 漂亮的页面是一个非常好的主意。因为您的应用 总有一天 会出现错误(请参考 记录应用错误 )
</p>
</div>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline24">异常捕捉</h3>
<div class="outline-text-3" id="text-2-10">
<p>
如下所示:
</p>
<div class="highlight"><pre><span></span><span class="nd">@app.errorhandler</span><span class="p">(</span><span class="mi">404</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">page_not_found</span><span class="p">(</span><span class="n">error</span><span class="p">):</span>
    <span class="k">return</span> <span class="n">render_template</span><span class="p">(</span><span class="s1">&#39;404.html&#39;</span><span class="p">),</span> <span class="mi">404</span>
</pre></div>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline25">logger</h3>
<div class="outline-text-3" id="text-2-11">
<pre>
app.logger.debug('A value for debugging')
</pre>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline26">文件上传</h3>
<div class="outline-text-3" id="text-2-12">
<p>
具体例子请参看我写的 <a href="https://github.com/a358003542/flask-examples">flask-examples</a> 那里，具体是 upload.py 。
</p>
</div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline31">组织你的项目</h2>
<div class="outline-text-2" id="text-3">
<p>
这里主要讨论更加成熟和稍微复杂点的那种做法。这个参看 <a href="http://spacewander.github.io/explore-flask-zh/4-organizing_your_project.html">这个网页</a> 。
</p>

<pre>
run.py
config.py
instance/
  /config.py
project/
  /__init__.py
  /views.py
  /models.py
  /forms.py
  /static/
  /templates/
</pre>

<p>
<code>run.py</code> 是作为启动开发服务器的脚本，里面内容一般很简单，大体是:
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">project</span> <span class="kn">import</span> <span class="n">app</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">app</span><span class="o">.</span><span class="n">run</span><span class="p">()</span>
</pre></div>

<p>
这样运行根据后面讲到的两个 <code>config.py</code> 的不同的设置来获得开发和工作不同的配置环境。比如这里具体是先加载顶层目录的config.py，然后再加载instance里面的config.py
</p>
<pre>
config loaded
instance config loaded
 * Debugger is active!
 * Debugger pin code: 916-109-430
</pre>


<p>
然后 <code>instance/config.py</code> 里面一般放着密钥，不纳入git版本控制，具体就是在 <code>.gitignore</code> 文件里面加入 <code>instance/</code> 。这样的话为了保证远程服务器那边能够正常运行，你需要在那边手工添加这个文件夹和文件，然后在里面加入你的密钥。因为其没有进入版本控制，所以我们还需要加入另外一个不太重要的 <code>config.py</code> 文件，其放着关于flask app的不太重要的一些配置信息。然后推荐最后确认加上 <code>debug=False</code> ，确保生产环境debug模式没有打开。
</p>

<p>
在project文件夹里面， <code>static</code> 文件夹和 <code>templates</code> 文件夹就如上这样放置，然后通过 <code>run.py</code> 来运行是可以正常启动的。而在生产环境下，比如通过gunicorn来启动flask的app，则执行如下命令:
</p>

<pre>
gunicorn -w 4 -b localhost:8001 project:app
</pre>

<p>
这样将直接调用你的project里面的app对象，并且没有打开debug。
</p>

<p>
<code>config.py</code> 和instance里面的config我们如下引入进来，具体在project的 <code>__init__.py</code> 里面:
</p>
<pre>
from flask import *
app = Flask(__name__, instance_relative_config=True)
app.config.from_object('config')
app.config.from_pyfile('config.py')
</pre>
<p>
其中 <code>instance_relative_config=True</code> 和 <code>app.config.from_pyfile('config.py')</code> 来引入instance文件夹里面的 <code>config.py</code> ，然后 <code>app.config.from_object('config')</code> 引入顶层目录下的 <code>config.py</code> 。
</p>

<p>
然后 <code>views.py</code> 和 <code>models.py</code> 里面的含义是很明显的，其中models.py里面一般定义一些数据库的模型，这个在project里面直接引入进来即可，而在 <code>views.py</code> 里面定义的一些视图函数我们也需要引入进来。这里值得一提的就是相对引入的用法:
</p>

<p>
在project的 <code>__init__.py</code> 里面有:
</p>
<pre>
#### more views
from .views import *
</pre>

<p>
在 <code>views.py</code> 里面有:
</p>
<pre>
from flask import *
from . import app

@app.route('/')
def index():
    return render_template('index.html', **locals())
</pre>

<p>
这种相对引入语法不支持直接运行脚本了，而需要在外面，通过 <code>run.py</code> 来运行，然后gunicorn那边也一切运行正常。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline28">配置文件的补充说明</h3>
<div class="outline-text-3" id="text-3-1">
<p>
上面提及的 <code>config.py</code> 里面大体放着这种形式的配置信息:
</p>
<pre>
DEBUG = True
</pre>

<p>
然后我们知道关于这些配置变量我们都可以通过 <code>app.config['WHAT']</code> 来加载。
</p>

<p>
上面提及的:
</p>
<pre>
app.config.from_object('config')
app.config.from_pyfile('config.py')
</pre>

<p>
先加载顶层目录的 <code>config.py</code> 然后再加载instance下的 <code>config.py</code> 。这样将形成一种覆盖机制，按照 <a href="http://spacewander.github.io/explore-flask-zh/5-configuration.html">这个网页</a> 的描述，我们可以在顶层设置:
</p>
<pre>
DEBUG = False
SQLALCHEMY_ECHO = False
</pre>

<p>
然后instance那边设置:
</p>
<pre>
DEBUG = True
SQLALCHEMY_ECHO = True
</pre>

<p>
生产环境那边将这两行不加上即可。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline30">使用蓝图来管理你的视图</h3>
<div class="outline-text-3" id="text-3-2">
<p>
随着你的项目变大，你可能需要使用蓝图来重构你的项目代码。蓝图有两种风格，一种是功能式架构，只是简单的新建一个视图views文件夹，然后在里面放着你的蓝图或说视图定义；另一种是各自独立的分区式，视图，模板，静态文件都在某个文件夹下面。这里只讨论稍显简单的功能式架构。
</p>

<p>
最简单的一个蓝图定义文件如下所示:
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">flask</span> <span class="kn">import</span> <span class="o">*</span>
<span class="kn">from</span> <span class="nn">..</span> <span class="kn">import</span> <span class="n">app</span>

<span class="n">index</span> <span class="o">=</span> <span class="n">Blueprint</span><span class="p">(</span><span class="s1">&#39;index&#39;</span><span class="p">,</span> <span class="n">__name__</span><span class="p">)</span>

<span class="nd">@index.route</span><span class="p">(</span><span class="s1">&#39;/&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">view_index</span><span class="p">():</span>
    <span class="k">return</span> <span class="n">render_template</span><span class="p">(</span><span class="s1">&#39;index.html&#39;</span><span class="p">,</span> <span class="o">**</span><span class="nb">locals</span><span class="p">())</span>
</pre></div>

<p>
大体和之前接触的flask的视图函数定义类似，只是额外新建了一个Blueprint对象，然后使用 <code>@index.route()</code> 这样的装饰器来装饰该蓝图的视图函数。
</p>

<p>
然后在project也就是 <code>__init__.py</code> 文件那里，把这个蓝图注册进来。
</p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">.views.index</span> <span class="kn">import</span> <span class="n">index</span>
<span class="n">app</span><span class="o">.</span><span class="n">register_blueprint</span><span class="p">(</span><span class="n">index</span><span class="p">)</span>
</pre></div>

<p>
最基本的情况就是这样，其他一切照旧。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline29">url_prefix</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
<code>url_prefix</code> 是你定义一个Blueprint对象是很有用的一个可选参数，意义很明显，就是该蓝图下所有的url都加上了这个前缀。
</p>
</div>
</div>
</div>
</div>
