电脑/python/flask/精通flask.org
* 用户管理规范
本小节主要参考了 [[http://spacewander.github.io/explore-flask-zh/12-handling_users.html][这个网页]] 。更成熟的方案请参看 flask-user


* restful api设计
这里主要参看了 [[http://www.pythondoc.com/flask-restful/index.html][这个网页]] ，但原创者在 [[https://github.com/sixu05202004/Flask-RESTful-cn][这里]] 。

** restful api简介
*** REST软件架构风格
REST(Representational State Transfer) 表征性状态传输是Roy Fielding在2000年提出的一种软件架构风格。目前在三种主流Web服务实现方案中，因为REST模式和复杂的SOAP和XML-RPC相比更加简洁，越来越多的web服务开始采用REST风格设计和实现。

*** REST系统设计规范
- 客户端-服务器 :: 客户端和服务器之间隔离，服务器提供服务，客户端进行消费。
- 无状态 :: 从客户端到服务器的每个请求都必须包含理解请求所必需的信息。换句话说，服务器不会存储客户端上一次请求的信息用来给下一次使用。
- 可缓存 :: 服务器必须明示客户端请求能否缓存。
- 分层系统 :: 客户端和服务器之间的通信应该以一种标准的方式，就是中间层代替服务器做出响应的时候，客户端不需要做任何变动。
- 统一的接口 :: 服务器和客户端的通信方法必须是统一的。
- 按需编码 :: 服务器可以提供可执行代码或脚本，为客户端在它们的环境中执行。这个约束是唯一一个是可选的。


*** RESTful API
符合REST设计风格的Web API称为RESTful API。RESTful API的核心概念是 *资源* 。资源可用URI表示，客户端用HTTP协议所定义的方法来请求这些URIs，当然也包括被访问资源状态的改变。

具体HTTP方法和对资源的操作如下所示:

| HTTP方法 | 行为             | URI示例                           |
|----------+------------------+-----------------------------------|
| GET      | 获取资源信息     | http://example.com/api/orders     |
| GET      | 获取某个特定资源 | http://example.com/api/orders/123 |
| POST     | 创建新的资源     | http://example.com/api/orders     |
| PUT      | 更新资源         | http://example.com/api/orders/123 |
| DELETE   | 删除资源         | http://example.com/api/orders/123 |


REST设计不需要特定的数据格式。在请求中数据可以以JSON形式, 或者有时候作为url中查询参数项。

** 我对restful api的反思
我觉得目前的restful api 设计有问题，不够实用。我同意api的描述应该偏资源，但应该再增加一类纯动作型api。实际上动作也是一种资源有的时候，但是动作作为资源的时候资源名一定要清晰的显示出来。然后资源的描述应该是URI风格的，弄个id挂在上面没什么用处还没有达到描述资源特征的目的。我们应该用统一的资源URL描述，下面简称为<path:path>

资源应该统一到一个URI上，弄个 ~/res~ 又还弄个 ~/res/id~ 纯属浪费。于是我提出建议如下:

1. 资源的描述URI应该侧重位置，然后跟上一个特征词，如下所示:
#+BEGIN_EXAMPLE
/resource_name/<path:res_uri>
#+END_EXAMPLE

2. 我们应该彻底杜绝 ~/~ 尾的URL。

3. 不用使用 ~/resource_name~ 这种形式来返回全部uri，推荐使用 ~/resource_name/main~ 来表达全部资源。其他名字如 ~all~ 等也是欢迎的，自己内部约定好即可。

4. 方法可以使用如下四种: get post put delete ，其中:

  - get 用于查询某个资源 （可以接受更多的查询参数 包括uri） 
  - post 用于insert某个资源 
  - put 用于更新某个资源
  - delete 用于删除某个资源 

然后delete可能会被 ~/delete_resname/<name>~ 这样的URL取代，甚至可能某些资源不需要删除操作，则上面的delete方法不需要编写。

put方法可能被 ~/update_resname/<name>~ 这样的URL取代，甚至可能insert和update逻辑都融合在post操作里面，则上面的put方法也不需要编写。

在视图层是推荐用上面的 ~/delete_resname/<name>~ 这样的风格，然后表单提交的时候更改 ~formaction~ 即可。而formmethod我们知道只能是 get 和 post 。然后如果insert和update逻辑好合并的则推荐合并为upsert逻辑，统一用post方法调用。

restfulapi则可以上面四个方法都编写出来，调用者清晰的知道意义就行了。
 
5. 返回json统一用如下格式:
#+BEGIN_EXAMPLE
{
    "resource_name" : [
                {
                       .....
                }
}
#+END_EXAMPLE

即使只返回一个资源也用这种格式，只是resource_name列表里面只包含一个元素罢了，更好的风格，没有元素也保持这种格式，只是里面的列表为空罢了。



** flask-restful插件
请参看 [[file:flask-restful.html][flask-restful]] 一文。
具体原生态的flask restful api代码编写就不在这里做了，有兴趣的可以看下本节开头提及参考资料的地一小节部分。



* 缓存
http://spacewander.github.io/explore-flask-zh/6-advanced_patterns_for_views_and_routing.html





* 附录
** 用gunicorn和nginx配置
gunicorn没啥好说的，就是命令行开个本地端口运行即可，主要是nginx那边的配置需要说一下。

首先nginx的配置文件编辑在这里: ~/etc/nginx/sites-available~

然后你需要激活这个网站，则如下在 ~sites-enabled~ 那里创建一个符号链接即可:
#+BEGIN_EXAMPLE
sudo ln -s /etc/nginx/sites-available/books /etc/nginx/sites-enabled/books 
#+END_EXAMPLE

然后nginx配置有很多内容，这里就最简单的说一下:

#+BEGIN_EXAMPLE
server{
	listen 80;
	server_name books.cdwanze.org;

	location /{
		 proxy_pass http://localhost:5000;
		 }

#+END_EXAMPLE

这是最简单的配置了，设置简单对外端口 ~listen~ ，然后设置 ~server_name~ 。然后 ~location /~ 那里设置 ~proxy_pass~ ，对应的就是具体你的guniron那边开的本地端口。参考了 [[https://www.digitalocean.com/community/tutorials/how-to-serve-flask-applications-with-gunicorn-and-nginx-on-ubuntu-14-04][这个网页]] 和 [[https://realpython.com/blog/python/kickstarting-flask-on-ubuntu-setup-and-deployment/][这个网页]] 。

更复杂的配置需要进一步学习nginx相关知识。

** 在heroku上部署项目
在heroku上部署项目其实很简单，只是感觉就是官方教程也谈论得干扰因素有点多了，比如说virtualenv，我会用，但总不喜欢用，不知道怎么回事。官方上手教程把virtualenv引进来一开始给我的感觉就是heroku而运作机制是依赖于virtualenv或者说本地的模块的，这其实是错误的。heroku在远程安装各个python的第三方模块都是通过pip命令来完成的，和你本地virtualenv具体的安装毫无关系，当然了有人会说通过pip freeze命令会很方便，但我真没看出这有多方便，如果这个项目是你自己写的，具体用了那几个模块你自己还不清楚吗。好了，闲话少说，首先谈谈python2和python3的问题。。

*** 指定python2或python3
在主文件夹目录下你新建一个 ~runtime.txt~ 文件，里面简单写上：
#+BEGIN_EXAMPLE
python-3.4.3
#+END_EXAMPLE

这样，远程heroku会帮你确定python运行环境为python-3.4.3。
#+BEGIN_EXAMPLE
remote: -----> Installing runtime (python-3.4.3)
#+END_EXAMPLE

就这么简单，同时要注意简写 ~python3~ 或者其他书写格式等都不支持，就作为python3里面还有其他版本号，按照 [[https://devcenter.heroku.com/articles/python-runtimes][heroku官方文档这里]] 的说法，pypy-1.9或者python-2.4.6或者python-3.3.3等这些都是支持的，但他们只确保python-2.7.10和python-3.4.3能够被很好地支持。【2015-06-09】


*** 安装第三方模块
这个也很简单，就在 ~requirements.txt~ 文件里面上写上模块名字即可。 比如：
#+BEGIN_EXAMPLE
flask
gunicorn
#+END_EXAMPLE

这样heroku远程会自动利用pip来安装对应的第三方模块，如下所示：
#+BEGIN_EXAMPLE
remote:        Installing collected packages: Werkzeug, markupsafe, Jinja2, itsdangerous, flask, gunicorn
#+END_EXAMPLE

我们看到flask依赖的其他第三方模块也安装上去了，然后这样自动安装的就是最新的模块的版本号，而我们不用virtualenv的话，本地也安装的是最新的版本号，这样也能起到检验的效果，而且也更简单。只有某些极个别的情况才会考虑固定模块的版本号，毕竟让模块更新到最近的版本号总是好的。当然了，这是我个人的体验，如果读者确实觉得virtualenv很好用，就当我没说。


*** Procfile文件
这是主文件夹和heroku配置相关的第三个文件，官方教程的是这样一行：
#+BEGIN_EXAMPLE
web: gunicorn hello:app --log-file=-
#+END_EXAMPLE

我们大致可以猜到这是heroku的初始化配置参数，比如web引擎用gunicorn，然后hello是app主入口等。这个后面再详细讨论。


*** hello.py文件
这个hello.py对应的就是上面的 ~hello:app~ 这句，告诉heroku了本app的主入口在哪里。

其内容就是最简单的flask演示hello world例子：
#+BEGIN_EXAMPLE
import os
from flask import Flask

app = Flask(__name__)

@app.route('/')
def hello():
    return 'Hello World!'
#+END_EXAMPLE

heroku远程是如何编译源文件的我们不管，然后接下来就是利用git把你写的源码推到heroku服务器上去，推上去之后heroku会自动编译一次源文件。


*** 安装heroku或者不？
按照官方文档的说明来，不赘述了。在ubuntu下的是：
#+BEGIN_EXAMPLE
wget -qO- https://toolbelt.heroku.com/install-ubuntu.sh | sh
#+END_EXAMPLE


本终端要登录一次，就是运行命令：
#+BEGIN_EXAMPLE
heroku login
#+END_EXAMPLE

登录的目的是什么？是为了有权限在heroku服务器上新建项目，也就是让你能够运行 ~heroku create~ 命令。但是我们日常用git推送是不需要heroku登录的，而且实际上这个 ~heroku create~ 命令你也可以不使用，你可以在heroku的网页上新建一个项目。 


