电脑/python/flask/精通flask.html


<div class="outline-2">
<h2 id="orgheadline32">表单</h2>
<div class="outline-text-2" id="text-4">
<p>
请参看 <a href="flask-wtf.html">flask-wtf</a> 一文。
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline33">用户管理规范</h2>
<div class="outline-text-2" id="text-5">
<p>
本小节主要参考了 <a href="http://spacewander.github.io/explore-flask-zh/12-handling_users.html">这个网页</a> 。更成熟的方案请参看 flask-user
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline40">restful api设计</h2>
<div class="outline-text-2" id="text-6">
<p>
这里主要参看了 <a href="http://www.pythondoc.com/flask-restful/index.html">这个网页</a> ，但原创者在 <a href="https://github.com/sixu05202004/Flask-RESTful-cn">这里</a> 。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline37">restful api简介</h3>
<div class="outline-text-3" id="text-6-1">
</div><div class="outline-4">
<h4 id="orgheadline34">REST软件架构风格</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
REST(Representational State Transfer) 表征性状态传输是Roy Fielding在2000年提出的一种软件架构风格。目前在三种主流Web服务实现方案中，因为REST模式和复杂的SOAP和XML-RPC相比更加简洁，越来越多的web服务开始采用REST风格设计和实现。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline35">REST系统设计规范</h4>
<div class="outline-text-4" id="text-6-1-2">
<dl class="org-dl">
<dt>客户端-服务器</dt><dd>客户端和服务器之间隔离，服务器提供服务，客户端进行消费。</dd>
<dt>无状态</dt><dd>从客户端到服务器的每个请求都必须包含理解请求所必需的信息。换句话说，服务器不会存储客户端上一次请求的信息用来给下一次使用。</dd>
<dt>可缓存</dt><dd>服务器必须明示客户端请求能否缓存。</dd>
<dt>分层系统</dt><dd>客户端和服务器之间的通信应该以一种标准的方式，就是中间层代替服务器做出响应的时候，客户端不需要做任何变动。</dd>
<dt>统一的接口</dt><dd>服务器和客户端的通信方法必须是统一的。</dd>
<dt>按需编码</dt><dd>服务器可以提供可执行代码或脚本，为客户端在它们的环境中执行。这个约束是唯一一个是可选的。</dd>
</dl>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline36">RESTful API</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
符合REST设计风格的Web API称为RESTful API。RESTful API的核心概念是 <strong>资源</strong> 。资源可用URI表示，客户端用HTTP协议所定义的方法来请求这些URIs，当然也包括被访问资源状态的改变。
</p>

<p>
具体HTTP方法和对资源的操作如下所示:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">HTTP方法</th>
<th scope="col" class="org-left">行为</th>
<th scope="col" class="org-left">URI示例</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">获取资源信息</td>
<td class="org-left"><a href="http://example.com/api/orders">http://example.com/api/orders</a></td>
</tr>

<tr>
<td class="org-left">GET</td>
<td class="org-left">获取某个特定资源</td>
<td class="org-left"><a href="http://example.com/api/orders/123">http://example.com/api/orders/123</a></td>
</tr>

<tr>
<td class="org-left">POST</td>
<td class="org-left">创建新的资源</td>
<td class="org-left"><a href="http://example.com/api/orders">http://example.com/api/orders</a></td>
</tr>

<tr>
<td class="org-left">PUT</td>
<td class="org-left">更新资源</td>
<td class="org-left"><a href="http://example.com/api/orders/123">http://example.com/api/orders/123</a></td>
</tr>

<tr>
<td class="org-left">DELETE</td>
<td class="org-left">删除资源</td>
<td class="org-left"><a href="http://example.com/api/orders/123">http://example.com/api/orders/123</a></td>
</tr>
</tbody>
</table>


<p>
REST设计不需要特定的数据格式。在请求中数据可以以JSON形式, 或者有时候作为url中查询参数项。
</p>
</div>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline38">我对restful api的反思</h3>
<div class="outline-text-3" id="text-6-2">
<p>
我觉得目前的restful api 设计有问题，不够实用。我同意api的描述应该偏资源，但应该再增加一类纯动作型api。实际上动作也是一种资源有的时候，但是动作作为资源的时候资源名一定要清晰的显示出来。然后资源的描述应该是URI风格的，弄个id挂在上面没什么用处还没有达到描述资源特征的目的。我们应该用统一的资源URL描述，下面简称为&lt;path:path&gt;
</p>

<p>
资源应该统一到一个URI上，弄个 <code>/res</code> 又还弄个 <code>/res/id</code> 纯属浪费。于是我提出建议如下:
</p>

<ol class="org-ol">
<li>资源的描述URI应该侧重位置，然后跟上一个特征词，如下所示:</li>
</ol>
<pre>
/resource_name/&lt;path:res_uri&gt;
</pre>

<ol class="org-ol">
<li>我们应该彻底杜绝 <code>/</code> 尾的URL。</li>

<li>不用使用 <code>/resource_name</code> 这种形式来返回全部uri，推荐使用 <code>/resource_name/main</code> 来表达全部资源。其他名字如 <code>all</code> 等也是欢迎的，自己内部约定好即可。</li>

<li>方法可以使用如下四种: get post put delete ，其中:

<ul class="org-ul">
<li>get 用于查询某个资源 （可以接受更多的查询参数 包括uri）</li>
<li>post 用于insert某个资源</li>
<li>put 用于更新某个资源</li>
<li>delete 用于删除某个资源</li>
</ul></li>
</ol>

<p>
然后delete可能会被 <code>/delete_resname/&lt;name&gt;</code> 这样的URL取代，甚至可能某些资源不需要删除操作，则上面的delete方法不需要编写。
</p>

<p>
put方法可能被 <code>/update_resname/&lt;name&gt;</code> 这样的URL取代，甚至可能insert和update逻辑都融合在post操作里面，则上面的put方法也不需要编写。
</p>

<p>
在视图层是推荐用上面的 <code>/delete_resname/&lt;name&gt;</code> 这样的风格，然后表单提交的时候更改 <code>formaction</code> 即可。而formmethod我们知道只能是 get 和 post 。然后如果insert和update逻辑好合并的则推荐合并为upsert逻辑，统一用post方法调用。
</p>

<p>
restfulapi则可以上面四个方法都编写出来，调用者清晰的知道意义就行了。
</p>

<ol class="org-ol">
<li>返回json统一用如下格式:</li>
</ol>
<pre>
{
    "resource_name" : [
                {
                       .....
                }
}
</pre>

<p>
即使只返回一个资源也用这种格式，只是resource_name列表里面只包含一个元素罢了，更好的风格，没有元素也保持这种格式，只是里面的列表为空罢了。
</p>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline39">flask-restful插件</h3>
<div class="outline-text-3" id="text-6-3">
<p>
请参看 <a href="flask-restful.html">flask-restful</a> 一文。
具体原生态的flask restful api代码编写就不在这里做了，有兴趣的可以看下本节开头提及参考资料的地一小节部分。
</p>
</div>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline41">缓存</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="http://spacewander.github.io/explore-flask-zh/6-advanced_patterns_for_views_and_routing.html">http://spacewander.github.io/explore-flask-zh/6-advanced_patterns_for_views_and_routing.html</a>
</p>
</div>
</div>





<div class="outline-2">
<h2 id="orgheadline58">附录</h2>
<div class="outline-text-2" id="text-8">
</div><div class="outline-3">
<h3 id="orgheadline42">用gunicorn和nginx配置</h3>
<div class="outline-text-3" id="text-8-1">
<p>
gunicorn没啥好说的，就是命令行开个本地端口运行即可，主要是nginx那边的配置需要说一下。
</p>

<p>
首先nginx的配置文件编辑在这里: <code>/etc/nginx/sites-available</code>
</p>

<p>
然后你需要激活这个网站，则如下在 <code>sites-enabled</code> 那里创建一个符号链接即可:
</p>
<pre>
sudo ln -s /etc/nginx/sites-available/books /etc/nginx/sites-enabled/books
</pre>

<p>
然后nginx配置有很多内容，这里就最简单的说一下:
</p>

<pre>
server{
	listen 80;
	server_name books.cdwanze.org;

	location /{
		 proxy_pass http://localhost:5000;
		 }
</pre>

<p>
这是最简单的配置了，设置简单对外端口 <code>listen</code> ，然后设置 <code>server_name</code> 。然后 <code>location /</code> 那里设置 <code>proxy_pass</code> ，对应的就是具体你的guniron那边开的本地端口。参考了 <a href="https://www.digitalocean.com/community/tutorials/how-to-serve-flask-applications-with-gunicorn-and-nginx-on-ubuntu-14-04">这个网页</a> 和 <a href="https://realpython.com/blog/python/kickstarting-flask-on-ubuntu-setup-and-deployment/">这个网页</a> 。
</p>

<p>
更复杂的配置需要进一步学习nginx相关知识。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline51">在heroku上部署项目</h3>
<div class="outline-text-3" id="text-8-2">
<p>
在heroku上部署项目其实很简单，只是感觉就是官方教程也谈论得干扰因素有点多了，比如说virtualenv，我会用，但总不喜欢用，不知道怎么回事。官方上手教程把virtualenv引进来一开始给我的感觉就是heroku而运作机制是依赖于virtualenv或者说本地的模块的，这其实是错误的。heroku在远程安装各个python的第三方模块都是通过pip命令来完成的，和你本地virtualenv具体的安装毫无关系，当然了有人会说通过pip freeze命令会很方便，但我真没看出这有多方便，如果这个项目是你自己写的，具体用了那几个模块你自己还不清楚吗。好了，闲话少说，首先谈谈python2和python3的问题。。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline43">指定python2或python3</h4>
<div class="outline-text-4" id="text-8-2-1">
<p>
在主文件夹目录下你新建一个 <code>runtime.txt</code> 文件，里面简单写上：
</p>
<pre>
python-3.4.3
</pre>

<p>
这样，远程heroku会帮你确定python运行环境为python-3.4.3。
</p>
<pre>
remote: -----&gt; Installing runtime (python-3.4.3)
</pre>

<p>
就这么简单，同时要注意简写 <code>python3</code> 或者其他书写格式等都不支持，就作为python3里面还有其他版本号，按照 <a href="https://devcenter.heroku.com/articles/python-runtimes">heroku官方文档这里</a> 的说法，pypy-1.9或者python-2.4.6或者python-3.3.3等这些都是支持的，但他们只确保python-2.7.10和python-3.4.3能够被很好地支持。【2015-06-09】
</p>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline44">安装第三方模块</h4>
<div class="outline-text-4" id="text-8-2-2">
<p>
这个也很简单，就在 <code>requirements.txt</code> 文件里面上写上模块名字即可。 比如：
</p>
<pre>
flask
gunicorn
</pre>

<p>
这样heroku远程会自动利用pip来安装对应的第三方模块，如下所示：
</p>
<pre>
remote:        Installing collected packages: Werkzeug, markupsafe, Jinja2, itsdangerous, flask, gunicorn
</pre>

<p>
我们看到flask依赖的其他第三方模块也安装上去了，然后这样自动安装的就是最新的模块的版本号，而我们不用virtualenv的话，本地也安装的是最新的版本号，这样也能起到检验的效果，而且也更简单。只有某些极个别的情况才会考虑固定模块的版本号，毕竟让模块更新到最近的版本号总是好的。当然了，这是我个人的体验，如果读者确实觉得virtualenv很好用，就当我没说。
</p>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline45">Procfile文件</h4>
<div class="outline-text-4" id="text-8-2-3">
<p>
这是主文件夹和heroku配置相关的第三个文件，官方教程的是这样一行：
</p>
<pre>
web: gunicorn hello:app --log-file=-
</pre>

<p>
我们大致可以猜到这是heroku的初始化配置参数，比如web引擎用gunicorn，然后hello是app主入口等。这个后面再详细讨论。
</p>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline46">hello.py文件</h4>
<div class="outline-text-4" id="text-8-2-4">
<p>
这个hello.py对应的就是上面的 <code>hello:app</code> 这句，告诉heroku了本app的主入口在哪里。
</p>

<p>
其内容就是最简单的flask演示hello world例子：
</p>
<pre>
import os
from flask import Flask

app = Flask(__name__)

@app.route('/')
def hello():
    return 'Hello World!'
</pre>

<p>
heroku远程是如何编译源文件的我们不管，然后接下来就是利用git把你写的源码推到heroku服务器上去，推上去之后heroku会自动编译一次源文件。
</p>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline47">安装heroku或者不？</h4>
<div class="outline-text-4" id="text-8-2-5">
<p>
按照官方文档的说明来，不赘述了。在ubuntu下的是：
</p>
<pre>
wget -qO- https://toolbelt.heroku.com/install-ubuntu.sh | sh
</pre>


<p>
本终端要登录一次，就是运行命令：
</p>
<pre>
heroku login
</pre>

<p>
登录的目的是什么？是为了有权限在heroku服务器上新建项目，也就是让你能够运行 <code>heroku create</code> 命令。但是我们日常用git推送是不需要heroku登录的，而且实际上这个 <code>heroku create</code> 命令你也可以不使用，你可以在heroku的网页上新建一个项目。 
</p>
</div>
</div>
