电脑/python/flask/精通flask.html


<div class="outline-4">
<h4 id="orgheadline48">通过网页新建项目得到一个好名字</h4>
<div class="outline-text-4" id="text-8-2-6">
<p>
通过网页我们新建的项目名字可以稍微取得好看点，然后新建完之后我们如何利用git将你的目标源码推送到那里去呢？首先git init ，然后git commit 这些我就不废话了，那么最关键的问题是heroku这个远程目的地地址在那里呢？
</p>

<p>
十分有趣的是我在网页上找了一下竟然找不到，但这又不是什么秘密。在.git的config里面，一个项目名 <code>secret-shore-9329</code> 的url是：
</p>
<pre>
url = https://git.heroku.com/secret-shore-9329.git
</pre>

<p>
再比如 <code>myheroku-1</code> 对应的是：
</p>
<pre>
git remote add heroku  https://git.heroku.com/myheroku-1.git
</pre>

<p>
然后接下来你就随意进行git管理项目和推送了。
</p>
</div>
</div>



<div class="outline-4">
<h4 id="orgheadline49">或者更简单直接通过github来管理</h4>
<div class="outline-text-4" id="text-8-2-7">
<p>
heroku还提供了一种更简单的项目管理方式，你可以在github上创建一个项目，然后在heroku上连接好这个github项目，然后推荐把下面那个 <strong>自动部署</strong> 也点上。然后你就可以如同往常一样 <code>git push origin master</code> ，将源码推送到github上即可。这样真是方便极了！
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline50">如何在heroku上加入数据库</h4>
<div class="outline-text-4" id="text-8-2-8">
<pre>
heroku  pg:psql --app cheminfo
</pre>


<pre>
heroku addons:add heroku-postgresql:dev --app cheminfo
</pre>
</div>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline56">和apache2一起</h3>
<div class="outline-text-3" id="text-8-3">
<p>
apache2是支持flask框架编写网络服务器的，更确切的表达是，apache2有一个模块，安装上它apache2就支持wsgi接口了。对于python2，在ubuntu下要安装的是:
</p>
<div class="highlight"><pre><span></span>sudo apt-get install  libapache2-mod-wsgi
</pre></div>

<p>
对于python3，要安装的是:
</p>

<div class="highlight"><pre><span></span>sudo apt-get install  libapache2-mod-wsgi-py3
</pre></div>

<p>
默认那个 <code>wsgi</code> 模块安装之后就激活了，你可以通过 <code>a2dismod</code> 来看一下，就是那个 <code>wsgi</code> 模块。 这里参考了 <a href="http://stackoverflow.com/questions/28019310/running-django-python-3-4-on-mod-wsgi-with-apache2">这个网页</a> 。
</p>

<p>
但是等一等，还有一些东西你需要配置，更多细节请参看flask框架官方文档的 <a href="http://flask.pocoo.org/docs/0.10/deploying/mod_wsgi/">这里</a> ，下面简单介绍之。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline52">简单的apache2配置</h4>
<div class="outline-text-4" id="text-8-3-1">
<p>
最简单的配置就是如下所示:
</p>

<pre>
WSGIScriptAlias / /home/wanze/workspace/cdwanze/cdwanze.wsgi

    &lt;Directory /home/wanze/workspace/cdwanze &gt;
    Require all granted
    &lt;/Directory&gt;
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline53">Require做了什么</h4>
<div class="outline-text-4" id="text-8-3-2">
<p>
其中 <code>Require all granted</code> 前面我们已谈到，是对访问权限的控制。参看apache2.2到apache2.4的 <a href="http://httpd.apache.org/docs/current/upgrading.html">升级文档</a> ，
原2.2配置:
</p>
<pre>
Order deny,allow
Deny from all
</pre>
<p>
等同于2.4配置:
</p>
<pre>
Require all denied
</pre>


<p>
原2.2配置:
</p>
<pre>
Order allow,deny
Allow from all
</pre>
<p>
等同于2.4配置:
</p>
<pre>
Require all granted
</pre>


<p>
原2.2配置:
</p>
<pre>
Order Deny,Allow
Deny from all
Allow from example.org
</pre>
<p>
等同于2.4配置:
</p>
<pre>
Require host example.org
</pre>

<p>
关于这里Order什么的配置更详细的说明参看 <a href="http://www.fwolf.com/blog/post/191">这个网页</a> 。其第一行就两种写法，逗号之间不能有空格。
</p>
<ol class="org-ol">
<li><code>Order Deny,Allow</code></li>
</ol>
<p>
在这个写法后面，后面先写允许谁谁谁访问，然后写禁止谁谁谁访问。如下所示:
</p>
<pre>
Order Deny,Allow
Deny from all
Allow from example.org
</pre>
<p>
这个写法的意思是禁止谁，允许谁，禁止所有只允许example.org访问。
</p>


<ol class="org-ol">
<li><code>Order Allow,Deny</code></li>
</ol>
<p>
和上面描述类似，除了先写允许再写禁止。
</p>

<p>
新的apache2.4的 <code>require</code> 语法更多细节请参看apache2官方文档的 <a href="http://httpd.apache.org/docs/2.4/howto/access.html">这里</a> 。接着前面的描述，还有如下表达:
</p>

<p>
允许某个具体的ip地址:
</p>
<pre>
Require ip ip.address
</pre>

<p>
在前面有了，全部都允许、全部都禁止、全部都禁止只允许谁。还有如下，全部都允许只禁止谁:
不允许某个ip地址。
</p>
<pre>
Require all granted
Require not ip 10.252.46.165
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline54">what.wsgi文件</h4>
<div class="outline-text-4" id="text-8-3-3">
<p>
这一行具体设置那个what.wsgi文件在那里，一般就放在flask框架源码第一目录下吧。
</p>
<pre>
WSGIScriptAlias / /home/wanze/workspace/cdwanze/cdwanze.wsgi
</pre>

<p>
然后这个what.wsig文件主要就是说明flask程序app对象在哪里。
</p>

<p>
这里首先把python的搜索路径加上，然后从你的flask主app对象所谓的文件中引入app，然后 <code>as application</code> 。
</p>
<pre>
import sys
sys.path.insert(0, '/home/wanze/workspace/cdwanze')

from cdwanze import app as application
</pre>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline55">更复杂点的配置</h4>
<div class="outline-text-4" id="text-8-3-4">
<p>
flask官方文档给出了更复杂点的配置如下所示:
</p>
<pre>
WSGIDaemonProcess cdwanze user=wanze group=wanze threads=5
WSGIScriptAlias / /home/wanze/workspace/cdwanze/cdwanze.wsgi

    &lt;Directory /home/wanze/workspace/cdwanze &gt;
    WSGIProcessGroup cdwanze
    WSGIApplicationGroup %{GLOBAL}

    Require all granted
    &lt;/Directory&gt;
</pre>

<p>
具体其似乎和用户权限管理有关，这里的细节我还不太懂，不过大体就是用户和群组的控制吧，然后还有一个线程控制。这里暂时先就这样了。
</p>
</div>
</div>
</div>







<div class="outline-3">
<h3 id="orgheadline57">参考资料</h3>
<div class="outline-text-3" id="text-8-4">
<ol class="org-ol">
<li>当然是flask的官方文档。 这里有一个 <a href="http://docs.jinkan.org/docs/flask/">中文翻译网页</a> ，这个网页左侧写着译者，应该是原创吧。</li>
<li><a href="https://exploreflask.com/">https://exploreflask.com/</a> 这里有一个 <a href="http://spacewander.github.io/explore-flask-zh/index.html">中文翻译网页</a> ，是原创者。</li>
<li>Flask Web Development; Author:Miguel Grinberg; Version:2014（我并不太喜欢这本书的喜欢用各种flask第三方插件的编码风格，大体翻看了一下，主要是看flask官方文档和官方example。）</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
